// Імпорти NPM ===========================================================
import { JSX } from "react/jsx-runtime";
// =======================================================================

// Імпорти компонентів ===================================================
import MessageComics from "../MessageComics/MessageComics";
import MoreInfo from "../MoreInfo/MoreInfo";
// =======================================================================

// Імпорти інтерфейсів ===================================================
import { Character } from "../../interfaces/globalIntefaces";
// =======================================================================

// Імпорти стилів ========================================================
// =======================================================================

// Імпорти зображень =====================================================
// =======================================================================

export default function CharacterPage(): JSX.Element {
  return (
    <main>
      <MessageComics />
      <MoreInfo<Character> url={"characters"} data={{ id: true, img: true, name: true, description: true }} />
    </main>
  )
}