// Імпорти NPM ===========================================================
import { JSX } from "react/jsx-runtime";
// =======================================================================

// Імпорти компонентів ===================================================
import MoreInfo from '../MoreInfo/MoreInfo';
import MessageComics from "../MessageComics/MessageComics";
// =======================================================================

// Імпорти інтерфейсів ===================================================
import { Comic } from "../../interfaces/globalIntefaces";
// =======================================================================

// Імпорти стилів ========================================================
// =======================================================================

// Імпорти зображень =====================================================
// =======================================================================

export default function ComicPage():JSX.Element {
  return (
      <main>
        <MessageComics/>
        <MoreInfo<Comic> url={"comics"} data={{id: true, img: true, title: true, price: true, description: true, pages: true, language: true}}/>
      </main>
  )
}