// Імпорти NPM ===========================================================
import { JSX } from "react/jsx-runtime";
import { NavLink } from "react-router-dom";
// =======================================================================

// Імпорти компонентів ===================================================
// =======================================================================

// Імпорти інтерфейсів ===================================================
// =======================================================================

// Імпорти стилів=========================================================
import "./header.scss";
// =======================================================================

// Імпорти зображень =====================================================
// =======================================================================

export default function Header(): JSX.Element {
    return (
        <header>
            <div className="limit">
                <div className="name">
                    <h1><span>Marvel</span> information portal</h1>
                </div>
                <nav className="pages">
                    <p>
                        <NavLink    
                            end 
                            to={"/"} 
                            style={({isActive}) => ({color: isActive ? '#9F0013' :  'black'})}>
                            Characters
                        </NavLink> 
                    </p>
                    <p>/</p>
                    <p>
                        <NavLink 
                            end 
                            to={"/comics"} 
                            style={({isActive}) => ({color: isActive ? '#9F0013' :  'black'})}>
                            Comics
                        </NavLink>
                    </p>
                </nav>
            </div>
        </header>
    );
}